using System.Collections.Generic;

public static class Alphabets
{
    public static string[] CyrillicAlphabet { get; } = new string[]
    {
            "а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и",
            "й", "к", "л", "м", "н", "о", "п", "р", "с", "т",
            "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь",
            "э", "ю", "я"
    };
    public static Dictionary<string, int> CyrillicDictionary { get; } = new()
    {
        {"а", 0}, {"б", 1}, {"в", 2}, {"г", 3}, {"д", 4},
        {"е", 5}, {"ё", 6}, {"ж", 7}, {"з", 8}, {"и", 9},
        {"й", 10}, {"к", 11}, {"л", 12}, {"м", 13}, {"н", 14},
        {"о", 15}, {"п", 16}, {"р", 17}, {"с", 18}, {"т", 19},
        {"у", 20}, {"ф", 21}, {"х", 22}, {"ц", 23}, {"ч", 24},
        {"ш", 25}, {"щ", 26}, {"ъ", 27}, {"ы", 28}, {"ь", 29},
        {"э", 30}, {"ю", 31}, {"я", 32}
    };

    public static Dictionary<string, int> LatinDictionary { get; } = new()
    {
        {"a", 0}, {"b", 1}, {"c", 2}, {"d", 3}, {"e", 4},
        {"f", 5}, {"g", 6}, {"h", 7}, {"i", 8}, {"j", 9},
        {"k", 10}, {"l", 11}, {"m", 12}, {"n", 13}, {"o", 14},
        {"p", 15}, {"q", 16}, {"r", 17}, {"s", 18}, {"t", 19},
        {"u", 20}, {"v", 21}, {"w", 22}, {"x", 23}, {"y", 24},
        {"z", 25}
    };
    public static string[] LatinAlphabet { get; } = new string[]
    {
        "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m",
        "n","o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z"
    };
}

